Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: ལས་རྣམས་ཕྲན་ཚེགས་དག་ལ་ནི། །རས་ནི་ཐ་མས་རྟག་ཏུ་འགྲུབ། །
en: “The cloth of the lowest quality should always be used To accomplish the least important activities.

source: རྫས་རྣམས་ཀུན་ལ་རྟག་ཏུ་ནི། །ལས་རྣམས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། །
en: Any activity will be accomplished And all substances always obtained. {4.35}

source: རས་གསུམ་གྱིས་ཀྱང་བསྟན་པ་ནི། །སྐལ་འདོད་མི་ལ་འགྲུབ་པ་ཡིན། །
en: “What is taught in the cloth ritual will bring accomplishment For people seeking good fortune.

source: བརྒྱ་བྱིན་བདེ་སོགས་བདག་པོ་ལའང་། །ཆོ་ག་ཉམས་ན་འགྲུབ་མི་འགྱུར། །
en: Those who stray from the right procedure— Even Śakra, the husband of Śacī—will not succeed. {4.36}

source: ཆོ་ག་ཡང་དག་ལྡན་ན་ནི། །མི་ཡི་སྐྱེ་བ་ཐ་མ་ལའང་། །ལས་རྣམས་ཐམས་ཅད་འབད་མེད་པར། །མྱུར་བ་ཉིད་དུ་འགྲུབ་པར་བྱེད། །
en: “Those, however, who follow the right procedure, Even those of lowly birth, Will swiftly succeed In all rituals without effort. {4.37}

source: རྒྱལ་བ་རྒྱ་མཚོ་སྲས་དག་གིས། །ལམ་འདི་དག་ནི་ཡང་དག་བསྟན། །
en: “This path has been taught By the victorious ones and their foremost sons

source: ཕོངས་པ་མགོན་མེད་སྡུག་བསྔལ་བའི། །སེམས་ཅན་ཀུན་ལ་ལེགས་སྦྱིན་པའོ། །
en: To improve the lot of all beings Suffering from poverty and lacking a protector. {4.38}

source: བྱང་ཆུབ་ལམ་ནི་མ་ལུས་ཀྱང་། །དེ་ཉིད་གཟིགས་པས་བསྟན་པ་སྟེ། །
en: “The complete path to awakening Has been explained by those who know the truth.

source: བྱང་ཆུབ་རྒྱུ་ཡི་ཆོས་འདི་ནི། །སྔགས་ཀྱི་ལམ་གྱིས་བསྟན་པ་ཡིན། །
en: This path, the cause of awakening, Is presented by means of the Mantra Vehicle. {4.39}

source: འཇིག་རྟེན་དཀྱིལ་འཁོར་མ་ལུས་དང་། །འཇིག་རྟེན་འདས་པའང་འགྲུབ་འགྱུར་ཏེ། །
en: “Mantras will be accomplished without effort, As will all mundane maṇḍalas.

source: དཀྱིལ་འཁོར་གང་དག་བསྟན་པ་ཡིས། །འབད་པ་མེད་པར་སྔགས་རྣམས་འགྲུབ། །
en: The supramundane ones that have been taught Will also be accomplished. {4.40}

source: གང་ཞིག་བྱང་ཆུབ་རྒྱུ་འདོད་པས། །དེ་ལ་རྟག་ཏུ་དངོས་གྲུབ་འགྱུར། །
en: “Those whose minds are set on awakening Will always gain accomplishment.

source: འགྲོ་ལ་ཕན་སེམས་རྟག་མེད་པ། །གཞན་ལ་འགྲུབ་པར་མི་འགྱུར་རོ། །
en: As for those who are always hostile to the world, Their accomplishment will not be taught in this manual. {4.41}

source: བདག་ཉིད་ཆེན་པོ་འཇམ་དཔལ་ནི། །གཞོན་ནུར་གྱུར་པས་ཁྱད་པར་དུ། །བྱང་ཆུབ་འཇུག་པའི་ཁྱད་སེམས་ལ། །རས་རིས་འགྲུབ་པར་གསུངས་པ་ཡིན། །
en: “The great being Mañjuśrī, the divine youth, Always taught this accomplishment In particular for those beings Who set out in pursuit of awakening. {4.42}

source: བྱ་བ་མྱུར་དུ་འགྲུབ་པའི་ཕྱིར། །ཐམས་ཅད་འདིར་ནི་ཐོབ་པ་ཡིན། །
en: “One can swiftly obtain this accomplishment in full For the sake of fulfilling that which needs to be done.

source: དེ་ནས་མཐར་གྱིས་བཟོ་བོས་ནི། །རས་ནི་འབད་པས་བཏགས་པར་བྱ། །
en: The craftsman should therefore Weave the cloth diligently, step by step, {4.43}

source: ཉིན་ཞག་ལྔ་དང་བརྒྱད་དང་ནི། །བཅུ་དྲུག་གཉིས་དང་བཞི་དང་ནི། །
en: “Working in two sessions of four time units each day, It will take him five or eight days of sixteen time units.

source: ཉིན་ཞག་གཅིག་གིས་མྱུར་དུ་ནི། །མྱུར་བར་རས་ཀྱི་ཐ་ག་བྱ། །
en: Working all day and all night, The weaving will be completed quickly. {4.44}

source: གྲུབ་པ་མཆོག་ནི་འདོད་པ་ཡིས། །ཉིན་ཞག་གཅིག་པ་དགེ་བ་ཡིན། །
en: “In the case of those who desire the accomplishment of the highest order The cloth should be completed within a single day and night.

source: གཙང་སྦྲའི་སྤྱོད་པ་ཕུན་སུམ་ཚོགས། །བཟོ་བོ་རྟག་ཏུ་བྱིན་བརླབས་ལྡན། །
en: The craftsman should be continually supervised To check whether he observes his purification practices. {4.45}

source: གནས་ནས་ཐག་རིང་སོང་ནས་ནི། །བཤང་དང་གཅི་བ་ཡོངས་སུ་དོར། །
en: “He should walk away from his dwelling the required distance To evacuate his bowels and bladder.

source: དེ་ནས་གོས་བཅས་ཁྲུས་བྱས་ཏེ། །གོས་གཞན་དག་ཀྱང་བགོ་བྱ་ཞིང་། །
en: He should then bathe and wash his clothes, Changing into the new ones. {4.46}

source: གོས་དཀར་ཕྲེང་བ་ལྡན་པར་འཆང་། །ཡང་དང་ཡང་དུ་ཉེ་རེག་བྱ། །
en: “Wearing white garments and a garland, He should rinse his mouth repeatedly,

source: ལུས་ནི་ཙནྡན་དཀར་པོས་བྱུགས། །བཟོ་བོས་ལག་པ་གཉིས་ཀྱང་བྱུགས། །
en: Anoint his body with white sandalwood, And wipe his hands clean. {4.47}

source: ལེགས་འཇམ་རྟག་ཏུ་དྲི་མེད་པར། །འབད་པས་ཀྱང་ནི་ཐ་ག་བྱ། །
en: “He should weave on with diligence, Making a fine and blemish-free cloth.

source: དེ་ལ་སོགས་པའི་སྦྱོར་བ་འམ། །གཞན་ནི་རྒྱལ་བས་གསུངས་པ་དང་། །
en: Using the previously mentioned methods Or other methods as taught by the victorious ones, {4.48}

source: རྣམ་དཔྱད་རང་བཞིན་འབད་པ་ཡིས། །རས་ནི་མ་ལུས་ཐ་ག་བྱ། །རས་ཀྱི་ཐ་ག་ཟིན་པ་དང་། །སྔར་གསུངས་ལས་ཀྱིས་ལེགས་བྱས་པ། །
en: “When the thoughtful and disciplined weaver Who weaves the entire cloth Creates it through the preceding rites And completes it as described, {4.49}

source: ཚད་ལྡན་ཉམས་པ་མེད་པ་ནི། །ཉིན་ཞག་བཟང་ལ་བལྟབ་སྟེ་བཞག །
en: “The practitioner should ensure, on an auspicious day, That it is not too small but of the right size and even.

source: ཡར་ངོའི་ཤིན་ཏུ་བཟང་པོ་ལ། །དེ་ལ་སྔགས་ནི་གཞུག་པར་བྱ། །
en: Then, during an auspicious bright fortnight, He should invest it with a mantra. {4.50}

source: རས་ནི་ཡོངས་སུ་གསལ་བྱས་པ། །ཁ་ཚར་མཐར་ནི་མདུད་མཛེས་བྱ། །
en: “Having spread out the cloth, Adorned with knotted tassels,

source: འོད་མའི་ཤིང་ལ་བཏགས་ནས་ནི། །དེ་ནས་རས་ནི་བླངས་ཏེ་འགྲོ། །
en: He should fasten it onto bamboo sticks, Then take it and go. {4.51}

source: བཟོ་བོ་བདེ་ལེགས་བྱས་ནས་ནི། །ནོར་མང་པོས་ནི་བགོ་བཤའ་བྱ། །
en: “He should congratulate the craftsman at length, Rewarding him with a substantial honorarium.

source: བརྟུལ་ཞུགས་བཟང་པོ་ལེགས་སྤྱོད་པའི། །སྔགས་པ་ཅི་ལྟར་འདོད་སོང་ནས། །
en: He should then go wherever he wishes, Sticking by his rules of conduct and ritual observances. {4.52}

source: མེ་ཏོག་དྲི་ཞིམ་གྱིས་མཆོད་དེ། །གཙང་བའི་ཕྱོགས་སུ་གཞག་པར་བྱ། །
en: “He should worship the cloth with fragrant flowers Then place it in a clean place

source: འདི་ཉིད་ཀྱི་ནི་སྔགས་ཀྱིས་སུ། །སྲུང་བའི་ཆོ་ག་རབ་ཏུ་བྱ། །
en: And perform the protection rite Using the mantra. {4.53}

source: སྔོན་ནི་རས་བལ་གང་དེ་ཡིས། །ལན་མང་དུ་ནི་ཡོངས་སྦྱངས་ལ། །
en: “To perform the protection rite He should use the same mantra With which he had earlier purified the cotton repeatedly.

source: བདག་ཉིད་དང་ནི་རས་དག་ལ། །དེ་ཉིད་ཀྱིས་ནི་བསྲུང་བར་བྱ། །
en: The protection should be both for himself and the cloth. {4.54}

source: དཔའ་བོ་ཆེན་པོ་འཇམ་དཔལ་གྱིས། །སྔགས་ཀྱི་བཟླས་པ་གསུངས་པ་དང་། །
en: “Mañjuśrī, he of great valor, Has been expressed in the form of mantra

source: འདས་པའི་སངས་རྒྱས་མང་པོ་དང་། །ངས་ཀྱང་ད་ལྟར་གསུངས་པ་ཡིན། །
en: In the past by many mantras And by me as well again and again. {4.55}

source: དེ་ཉིད་སྔགས་ནི་ཐམས་ཅད་ཀྱི། སྔགས་ཀྱི་ངོ་བོས་རྣམ་པར་སྤྱོད། །
en: “He, the very nature of mantra, Pervades all mantras;

source: བརྩོན་འགྲུས་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ། །སྔགས་ཀྱི་དོན་ཀུན་སྒྲུབ་བྱེད་པ། །
en: With great valor and efficacy, He fulfills the aims of all mantras. {4.56}

source: ཆ་བྱད་རྣམ་པ་སྣ་ཚོགས་བྱེད། །སྐྱོབ་པ་རྣམ་པ་སྣ་ཚོགས་རྒྱུ། །
en: “He takes a great diversity of forms And serves as the cause for all manner of protection.

source: འཛམ་གླིང་གནས་པའི་སེམས་ཅན་རྣམས། །རྨོངས་པ་སྤྱོད་ཅིང་སེམས་པ་མེད། །
en: Foolish are the minds and behavior Of beings living in Jambūdvīpa. {4.57}

source: མ་དད་ཕྱིན་ཅི་ལོག་པར་བྱེད། །
en: “They are devoid of faith and perverted;

source: ལོག་སྤྱོད་ཤིན་ཏུ་བརྐམ་ཆགས་ཀྱིས། །
en: They follow mistaken conduct and are very greedy.

source: རྫས་རྣམས་མ་ལུས་པ་དག་དང་། །སྔགས་རྣམས་ཀྱིས་ཀྱང་འགྲུབ་མི་བྱེད། །
en: They are unable to accomplish the mantras, Nor can they obtain any substances. {4.58}

source: འཁོར་བའི་མུན་པའི་བཙོན་རར་ནི། །དེ་ཉིད་ཀྱིས་ནི་འཁོར་བར་འགྱུར། །
en: “And so they wander In the dark prison of saṃsāra.

source: གང་ཡང་རྟག་ཏུ་ཡི་དག་ཅིང་། །དད་ལྡན་བཀྲ་ཤིས་དག་ལ་དགའ། །
en: However, if one has a pure mind, Constant faith, and keen interest in the auspicious; {4.59}

source: སྔགས་རྣམས་ཀུན་ལ་སྤྲོ་བ་དང་། །རྟག་ཏུ་འཛིན་དང་འཆང་བ་དང་། །
en: “If one is constantly eager To grasp and maintain all the mantras;

source: བདག་ཉིད་ཆེན་པོ་དངོས་གྲུབ་འདོད། །སྤྲོ་བ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ། །
en: And if such a great being desires accomplishment And has great perseverance and energy, {4.60}

source: རྒྱལ་བས་གསུངས་པའི་སྔགས་དག་ནི། །འབད་པ་མེད་པར་འགྲུབ་པར་འགྱུར། །
en: “The mantras taught by the victorious ones Will bring him results without effort.

source: དད་པ་མེད་པའི་སྐྱེ་བོ་ལ། །དཀར་པོའི་ཆོས་རྣམས་མི་སྐྱེ་སྟེ། །
en: But among those without faith, The virtuous Dharma will not grow. {4.61}

source: ས་བོན་ཚྭ་སྒོར་བཏབ་པ་ལ། །མྱུ་གུ་སྐྱེ་བ་མེད་པ་བཞིན། །
en: “It is like a seed sown in salty soil, Whose sprout will not bear fruit.

source: དད་པའི་རྩ་བ་རྟག་ཏུ་ཆོས། །ཆོས་དོན་གཟིགས་པས་གསུངས་པ་སྟེ། །
en: Faith is always the root of Dharma, As has been taught by all those who show the true goal.

source: ཆོས་དོན་སྤྱོད་པ་དེ་དག་ལ། །སྔགས་རྣམས་རྟག་ཏུ་འགྲུབ་པར་གསུངས། །
en: The accomplishment of mantra, as has always been taught, Belongs to those disciplined for the sake of the Dharma. {4.62}

source: དེ་ནས་སྒྲུབ་པ་པོས་བཟོ་བོ་ལེགས་པར་བསླབ་པའི་རི་མོ་མཁན་ནམ། བདག་ཉིད་འདྲི་བ་ལ་མཁས་པས། ཚོན་མ་འདྲེས་ཤིང་ཁ་དོག་གསལ་བ་དང་ལྡན་པའི་ཚོན་རྩི་རྣམས་བླངས་ཏེ
en: “Therefore, only a well-trained painter skilled in sādhana, or oneself if able to, should do the painting using uncontaminated paints.

source: སྔར་ཐ་ག་པ་ལ་བྱས་པའི་ཆོ་ག་ཅི་ལྟ་བ་དེ་ཉིད་ཀྱི་མཚན་ཉིད་དང་ལྡན་པས། རི་མོ་མཁན་ལ་སྔ་མ་བཞིན་སྦྱར་བར་བྱ་སྟེ།
en: The painter, having undergone the ritual procedure as previously described for preparing the weaver, and endowed with the auspicious marks and so forth should choose any bright paints of strong colors and execute the painting in detail.

source: སྔར་ཅི་ལྟར་ཐ་ག་པ་ལ་བྱས་པ་དེ་ཉིད་ཀྱིས་རས་ལ་རི་མོ་འདྲིར་གཞུག་གོ། །ཡང་ན་བདག་ཉིད་ཀྱིས་བྲི་བར་བྱའོ། །
en: The painting may be commissioned or done by oneself adhering to the same procedure as before in the case of the weaver. {4.63}

source: ག་པུར་དང་ཙནྡན་དང་གུར་གུམ་ལ་སོགས་པའི་དྲིས་ཚོན་རྩི་ལ་བསྒོ་བར་བྱ་ཞིང་བདུག་སྤོས་བསྲེགས་ཏེ། དེ་ཉིད་ཀྱི་སྔགས་ཀྱིས་ལན་བརྒྱ་རྩ་བརྒྱད་འཁོར་དང་བཅས་པ་ལ་ཡང་བཟླ་སྟེ།
en: “One should infuse the paints with camphor, saffron, sandalwood, and so forth, and then, burning incense, incant them with the very same mantra one hundred and eight times.

source: མེ་ཏོག་ནཱ་ག་གེ་སར་དང་པུན་ནཱ་ག་དང་བ་ཀུ་ལ་དང་ཙམ་པ་ཀ་དང་དབྱར་གྱི་མེ་ཏོག་དང་དྷཱ་ནུཤྐ་རི་དང་མཱ་ལ་ཏིའི་མེ་ཏོག་ལ་སོགས་པས་རས་དེ་གཅལ་བཀྲམ་པ་བྱས་ལ།
en: One should bestrew the cloth with the blossoms of the ironwood tree, pannay tree, bulletwood tree, and the flowers of champak, Arabian jasmine, dhānuṣkārika jasmine, and royal jasmine.

source: ཤར་དུ་མངོན་པར་ཕྱོགས་པས་ཀུ་ཤའི་ཁྲེས་ལ་འདུག་སྟེ་བློ་ལེགས་པར་གནས་པ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ལ་དམིགས་པའི་སེམས་ཀྱིས་པིར་ཕྲ་མོ་ལག་པར་བླངས་ནསའཁྲུག་པ་མེད་པའི་སེམས་ཀྱིས་རས་དེ་ལ་བྲི་བར་བྱའོ། །
en: Then, sitting on a bundle of kuśa grass and facing east, with a settled mind and thoughts directed to all the buddhas and bodhisattvas, one should take hold of a fine-tipped brush and, with a relaxed mind, commence the painting. {4.64}

source: དང་པོར་རེ་ཞིག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་བྲི་བར་བྱ་སྟེ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་མཚན་པ། སྐུ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ཉེ་བར་མཛེས་པ་རིན་པོ་ཆེའི་པདྨ་ལ་བཞུགས་པ་ཀུན་ནས་འོད་འབར་བ། སྐུ་འོད་འདོམ་གང་གིས་ཉེ་བར་མཛེས་པ་ཆོས་འཆད་བཞིན་པ།
en: “First one should paint the Tathāgata Śākyamuni, endowed with all of his excellent forms, his body marked with the thirty-two marks of a perfect man and adorned with the eighty minor characteristics. He sits on a jeweled lotus, his form surrounded by a halo of light to the distance of one fathom all around.

source: སྐུ་དང་ཞིང་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ། དབུས་ན་གནས་པའི་པདྨ་བཻ་ཌཱུརྱའི་སྡོང་བུ་ཅན་འོག་ན་ནི་ཀླུའི་རྒྱལ་པོ་གཉིས་ཀྱི་གདན་ཆེན་པོའི་པདྨའི་སྡོང་བུ་ལ་འཛིན་ཅིང་།
en: He teaches the Dharma with a serene expression. {4.65} “Beneath the great throne in the center, which consists of a lotus with a strong beryl stalk, are two nāga kings—Nanda and Upananda—who support the stalk.

source: དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ། ལག་པ་གཡས་པས་ཕྱག་འཚལ་བ། མདོག་དཀར་པོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་མི་དང་འདྲ་བ། ཕྱེད་སྦྲུལ་གྱི་གཟུགས་ཅན་དགའ་བོ་དང་ཉེ་དགའ་བྲི་བར་བྱའོ། །
en: They should be painted in half- human , half-serpent form, looking at the Tathāgata and greeting him with their right hands.

source: ཀུན་ནས་པདྨའི་མཚོ་པདྨའི་འདབ་མ་དང་མེ་ཏོག་ཅུང་ཟད་ཁ་བྱེ་བ་དང་། རྣམ་པར་ཁ་བྱེ་བ་དང་ཆུ་ལས་སྐྱེས་པའི་སྲོག་ཆགས་རྣམས་དང་། བྱ་དང་ཉ་ལ་སོགས་པས་ཁྱབ་པ་ཡངས་ཤིང་མཛེས་པར་སྐྱེས་པ་བྲི་བར་བྱའོ། །
en: A lotus pond should be painted surrounding them that is filled with lotus leaves and flowers with opening buds and teeming with aquatic creatures such as birds, fish, and so forth. All the figures throughout it should be of exquisite form. {4.66}

source: གང་བཅོམ་ལྡན་འདས་ཀྱི་རྩ་བའི་པདྨའི་སྡོང་བུ་དེ་ལས་འཕྲོས་པའི་ཡལ་ག་ལས་པདྨའི་མེ་ཏོག་དུ་མ་མཐར་གྱིས་མཐོ་བ་བྱའོ། །
en: “At the base of the stem of the Blessed One’s lotus spring several other lotus flowers, all growing progressively higher. To his

source: གཡོན་གྱི་ཕྱོགས་སུ་པདྨའི་མེ་ཏོག་བརྒྱད་བྱས་ཏེ། པདྨ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་ཀྱི་གཟུགས་བཞུགས་པ་བྲི་བར་བྱའོ། །
en: left, eight lotuses should be drawn with the figures of the eight great bodhisattvas seated upon them. {4.67}

source: དང་པོ་ལ་རེ་ཞིག་འཕགས་པ་འཇམ་དཔལ་ཅུང་ཟད་ཁ་དོག་པདྨའི་གེ་སར་བཞིན་དུ་སེར་སྐྱའམ་གུར་གུམ་མམ་གསེར་གྱི་མདོག་འདྲ་བ་གཞོན་ནུའི་ཆ་བྱད་བྱིས་པ་དང་།
en: “On the first lotus is Noble Mañjuśrī. His color is either whitish like the filaments of a lotus or golden like saffron. His form is that of a divine youth with the features of a young male child.

source: ཁྱེའུའི་གཟུགས་ཅན་སྐྲ་ཟུར་ཕུད་ལྔ་དང་ལྡན་པ། གཞོན་ནུའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: On his head are five decorative locks of hair, and he is ornamented with all the adornments of a divine youth.

source: ལག་པ་གཡོན་པ་ན་ཨུཏྤལ་སྔོན་པོ་བསྣམས་པ།
en: In his left hand he holds a blue lotus,

source: ལག་པ་གཡས་པས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་བྱེད་པ། སྐུ་མཛེས་པ་ཞི་བའི་ཆ་བྱད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ། བཞིན་ཅུང་ཟད་རྒོད་པ་འོད་འབར་བ་དང་ལྡན་པས་དཀྱིལ་འཁོར་ཀུན་དུ་ཁྱབ་པ་བྲིའོ། །
en: and with his right he salutes the Tathāgata, at whom he is directing his gaze. His bodily form is charming and peaceful, with a slightly laughing countenance, and a halo of blazing light encircling him. {4.68}

source: པདྨ་གཉིས་པ་ལ་འཕགས་པ་ཟླ་བའི་འོད་ཤིན་ཏུ་གཞོན་ཤ་ཅན་དེ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: “The noble Candraprabha should be painted on the second lotus, also in the form of a divine youth.

source: གསུམ་པ་ལ་ནི་ནོར་བཟང་ངོ་། །
en: On the third should be Sudhana;

source: བཞི་པ་ལ་ནི་སྒྲིབ་པ་རྣམ་པར་སེལ་བའོ། །
en: on the fourth, Sarva­nīvaraṇa­viṣkambhin;

source: ལྔ་པ་ལ་ནི་ནམ་མཁའ་མཛོད་དོ། །
en: on the fifth, Gaganagañja;

source: དྲུག་པ་ལ་ནི་སའི་སྙིང་པོའོ། །
en: on the sixth, Kṣitigarbha;

source: བདུན་པ་ལ་ནི་སྡིག་མེད་དོ། །
en: on the seventh, Anagha;

source: བརྒྱད་པ་ལ་ནི་སྤྱན་བཟང་ཡིན་ཏེ།
en: and on the eighth, Sulocana.

source: དེ་དག་ཐམས་ཅད་ཀྱང་གཞོན་ནུ་ཁྱེའུའི་ཆ་བྱད་ཅན། གཞོན་ནུའི་རྒྱན་གྱིས་བརྒྱན་པ་བྲི་བར་བྱའོ། །
en: All of them should be painted as divine youths ornamented with the corresponding adornments. {4.69}

source: བཅོམ་ལྡན་འདས་ཀྱི་གཡས་ཕྱོགས་སུ་ནི། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་བྱམས་པ་མ་གཏོགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “To the right of the Blessed One there are another eight great bodhisattvas, all of them, except Maitreya, adorned with all types of jewelry.

source: འཕགས་པ་བྱམས་པ་ནི་བཅོམ་ལྡན་འདས་དང་ཉེ་བར་བྲི་བར་བྱ་སྟེ། ཚངས་པར་སྤྱོད་པའི་ཆ་བྱད་འཛིན་པ། མགོ་རལ་པའི་ཅོད་པན་བཅིངས་པ།
en: The noble Maitreya, who is next to the Blessed One, wears the attire of one who is celibate and has a topknot held up with a crown.

source: མདོག་གསེར་འདྲ་བ། ག་ཤ་དམར་པོ་གྱོན་པ།
en: His body is golden colored and his robes red ocher.

source: དར་ལ་དམར་པོའི་སྟོད་གཡོགས་བྱས་པ།
en: His silken upper garment is red.

source: ཐལ་བའི་ཐིག་ལེ་གསུམ་གྱིས་མཚན་པ།
en: His elegant form is marked with the triple line of an ascetic.

source: གཟུགས་མཛེས་པ་དང་ལྡན་པ་དབྱིག་པ་དང་སྤྱི་བླུགས་འཛིན་པ་ཀྲིཥྞ་ས་རའི་པགས་པ་ཐལ་གོང་གཡོན་པར་བགོས་པ།
en: Inside his left arm he carries a staff with a water jar suspended from it, and he has a black antelope skin thrown over his left shoulder.

source: ལག་པ་གཡོན་པས་ཕྲེང་བ་འཛིན་ཅིང་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་བྱེད་པ། དེར་གཏོད་པའི་ལྟ་བ་སེམས་ཀྱི་སྤྱོད་པ་བསམ་གཏན་ལ་དམིགས་པའི་རྣམ་པ་ཅན་ནོ། །
en: With his right hand he holds a rosary and greets the Tathāgata at whom he directs his gaze. His mental activity has its basis in mental absorption. {4.70}

source: པདྨ་གཉིས་པ་ལ་འཕགས་པ་ཀུན་དུ་བཟང་པོ་མདོག་མེ་ཏོག་པྲི་ཡང་ཀུ་ལྟར་སྔོ་སངས། ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “On the second lotus is Samantabhadra, his body the dark color of the beautyberry flower and adorned with all types of jewelry.

source: ལག་པ་གཡོན་པ་ན་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པ། ལག་པ་གཡས་པ་ན་བིལ་བ་ཐོགས་ཤིང་མཆོག་སྦྱིན་པ།
en: In his left hand he holds a wish-fulfilling gem and in his right a bel fruit, which he holds out in the boon-granting gesture.

source: གཟུགས་མཛེས་པ་དང་ལྡན་པ་དེ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: He should also be painted with a charming form. {4.71}

source: གསུམ་པ་ལ་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འདམ་བུའི་མདོག་འདྲ་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “On the third lotus is the noble Avalokiteśvara, white as the autumn moon and adorned with all types of jewelry.

source: རལ་པའི་ཅོད་པན་འཆང་བ། མཆོད་ཕྱིར་ཐོགས་དཀར་པོས་བྱས་པ།
en: He wears a topknot and a crown and is invested with a white sacred thread.

source: འཕགས་པ་འོད་དཔག་མེད་གཟུགས་མཛེས་ཤིང་ཡིད་དུ་འོང་བ། སྟོབས་བཅུ་དང་ལྡན་པ། རལ་པའི་མཐར་སྐྱིལ་མོ་ཀྲུང་གིས་བཞུགས་ཤིང་ཅོད་པན་དུ་བྱས་པ།
en: On his head is the noble omniscient Amitābha, sitting nestled in the ends of his matted hair—wondrous and beautiful in form and possessed of the ten powers.

source: ལག་པ་གཡོན་ན་པདྨ་བསྣམས་པ། ལག་པ་གཡས་པ་མཆོག་སྦྱིན་པ།
en: He should be painted holding a lotus in his left hand and displaying the boon-granting gesture with his right.

source: སེམས་ཀྱི་སྤྱོད་པ་བསམ་གཏན་ལ་དམིགས་པའི་རྣམ་པ་ཅན། ལུས་ཀུན་ནས་འོད་ཀྱིས་གསལ་བར་བྱས་པའོ། །
en: His mental activity is grounded in mental absorption, and his body is surrounded by light. {4.72}

source: བཞི་པ་ལ་ནི་འཕགས་པ་ཕྱག་ན་རྡོ་རྗེ་ལག་པ་གཡོན་ན་རྡོ་རྗེ་འཛིན་པ།
en: “On the fourth lotus is the noble Vajrapāṇi, with a vajra in his left hand.

source: ལག་པ་གཡས་ན་བིལ་བ་ཐོགས་པས་མཆོག་སྦྱིན་པ་མདོག་གསེར་འདྲ་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཟུགས་མཛེས་པ། ཞི་བའི་ལྟ་བ་དང་ལྡན་པ་དང་།
en: Golden in color, he is adorned with all kinds of jewelry. His right hand is clasped around a fruit and displays a boon-granting gesture. His charming form is of gentle aspect.

source: དྲ་བ་དང་དྲ་བ་ཕྱེད་པས་ལུས་ཉེ་བར་དཀྲིས་པ་མུ་ཏིག་གི་ཕྲེང་བས་མཆོད་ཕྱིར་ཐོགས་བྱས་པ། ཅོད་པན་རིན་པོ་ཆེ་འབར་བས་རྣམ་པར་འཕྲོ་བ་གོས་གཡོ་བ་དང་ལྡན་པ་བགོས་པ་དར་ལ་དཀར་པོའི་སྟོད་གཡོགས་བྱས་པའོ། །
en: His body is adorned with long and short pearl necklaces, and a pearl necklace serves as his sacred thread. He wears a crown studded with sparkling jewels, short trousers of fine cloth, and an upper garment of white silk.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་ཀུན་དུ་བཟང་པོའི་ན་བཟའ་སྟོད་གཡོགས་ཀྱང་འདི་བཞིན་དུ་བྱའོ། །ཆ་བྱད་ནི་ཅི་ལྟར་སྔར་བསྟན་པ་བཞིན་བྱའོ། །
en: Just like the noble Avalokiteśvara and Samantabhadra, he wears a cloak used for visiting holy bathing places, and his appearance is as previously described. {4.73}

source: དེ་བཞིན་དུ་པདྨ་ལྔ་པ་ལ་ནི་འཕགས་པ་བློ་གྲོས་ཆེན་པོ།
en: “On the fifth lotus is the noble Mahāmati;

source: དྲུག་པ་ལ་ནི་བློ་གྲོས་ཞི་བ།
en: on the sixth, Śāntamati;

source: བདུན་པ་ལ་ནི་རྣམ་པར་སྣང་མཛད་སྙིང་པོ། །
en: on the seventh, Vairocana­garbha;

source: བརྒྱད་པ་ལ་ནི་ངན་སོང་སྤོང་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་བྲི་བར་བྱ་སྟེ།
en: and on the eighth, Apāyajaha—these bodhisattvas, too, should be depicted.

source: བིལ་བའི་འབྲས་བུ་དང་གླེགས་བམ་ལག་ན་ཐོགས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་མཛེས་པ། དར་ལས་སྟོད་གཡོགས་བྱས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཡོ་བ་དང་ལྡན་པའི་གོས་བགོས་པའོ། །
en: They hold in their hands fruits and books, are adorned with all types of jewelry, and wear an upper garment and short trousers of fine silk. {4.74}

source: དེ་དག་གི་སྟེང་དུའང་རང་སངས་རྒྱས་བརྒྱད་བྲི་བར་བྱ་སྟེ། དགེ་སློང་གི་ཆ་བྱད་འཛིན་པ་ལུས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་དང་ལྡན་པ།
en: “Above them should be painted the eight pratyeka­buddhas, attired in monks’ garb.

source: ཆོས་གོས་དམར་པོ་གྱོན་པ། སྐྱིལ་མོ་ཀྲུང་གིས་ཉེ་བར་གནས་པ། རིན་པོ་ཆེའི་ཨུཏྤལ་ལ་འདུག་པ་ཆ་བྱད་ཞི་བའི་བདག་ཉིད་ཀུན་ནས་འོད་འཕྲོ་བའི་ཕྲེང་བས་ཁྱབ་པ། མེ་ཏོག་དྲི་ཞིམ་པོས་གཅལ་བཀྲམ་པ་ལ་འདི་ལྟ་སྟེ།
en: Their robes are red ocher and their bodies possess the marks of a great being. They sit cross-legged on seats of jeweled lotuses in serene absorption, surrounded by halos of blazing light.

source: མེ་ཏོག་མཱ་ལི་ཏ་དང་དབྱར་གྱི་མེ་ཏོག་དང་། དྷཱ་ནུཥྐ་རི་ཀ་དང་པུན་ནཱ་ག་དང་ནཱ་ག་གེ་སར་ལ་སོགས་པའི་མེ་ཏོག་གིས་རས་རིས་ཀུན་ནས་གཅལ་བཀྲམ་པར་བྲི་བར་བྱའོ། །
en: While painting the picture, one should strew the cloth with fragrant flowers such as royal jasmine, Arabian jasmine, dhānuṣkārikā jasmine, blossoms of the pannay tree and ironwood tree, and so forth. {4.75}

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་གཡོན་ཕྱོགས་སུ་འཕགས་པ་འཇམ་དཔལ་གྱི་སྟེང་དུ་རིན་པོ་ཆེ་དུ་མས་ཉེ་བར་སྤྲས་པ། ཤིན་ཏུ་ཡངས་པའི་གཞལ་མེད་ཁང་གི་དཀྱིལ་འཁོར་བྲག་གི་ཚོགས་ཀྱིས་ཤིན་ཏུ་ཉེ་བར་མཛེས་པར་བྱས་པ།
en: “To the left of Lord Śākyamuni and above Noble Mañjuśrī one should paint a lofty palatial maṇḍala, decorated with many gems and adorned with the king of mountains.

source: རིན་པོ་ཆེའི་ཨུཏྤ་ལས་ཤིན་ཏུ་བཀབ་པ་རིའི་རྣམ་པ་ལྟ་བུ་བྲི་བར་བྱའོ། །
en: It has the shape of a mountain entirely covered with precious stones.

source: གནས་དེར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བརྒྱད་བྲི་བར་བྱ་སྟེ།
en: There one should paint the eight blessed buddhas, as listed below. {4.76}

source: འདི་ལྟ་སྟེ་རིན་ཆེན་གཙུག་ཏོར་ཅན་རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་འོད་རྣམ་པར་འཕྲོ་བ། ཀུན་ནས་འོད་འདོམ་གང་བ། རིན་པོ་ཆེ་པདྨ་རཱ་ག་དང་ཨིནྡྲ་ནཱི་ལ་དང་། མརྒད་ལ་སོགས་པ་དང་། བཻ་ཌཱུརྱ་དང་ཨསྨ་གར་བྷ་ལ་སོགས་པ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་བྱེ་བྲག་ཀུན་ནས་འོད་འཕྲོ་བ་དང་ལྡན་པ་ཉི་མ་འཆར་ཀའི་མདོག་འདྲ་བ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལྷུང་བཟེད་དང་ཆོས་གོས་དང་བླ་གོས་དང་ལྡན་པ། སྐྱིལ་ཀྲུང་གིས་བཞུགས་ཤིང་ཆོས་འཆད་པ།
en: “The first, Ratnaśikhin, should be painted adorned with jewels the color of beryl and with an aura of light extending one fathom all around him. He shines in all directions with the glow of many exquisite jewels, such as rubies, sapphires, emeralds, beryls, and so forth. His body of a tathāgata has the soft color of the rising sun. He wears the yellow robes and upper garment of a monk, sits in the cross-legged posture, and expounds the Dharma.

source: ན་བཟའ་སེར་པོ་མནབས་པ།
en: His outer garment is yellow.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་གྱིས་སྐུ་ལ་ཁྱབ་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་སྐུ་ཉེ་བར་མཛེས་པ།
en: His body is armored with the thirty-two marks of a great being and is also adorned with the eighty minor marks.

source: ཞི་བའི་གཟིགས་པ་དང་ལྡན་པ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་བྲི་བར་བྱའོ། །
en: He is of peaceful appearance and in all aspects excellent. Thus should Tathāgata Ratnaśikhin be depicted. {4.77}

source: གཉིས་པ་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པའི་དབང་པོའི་རྒྱལ་པོ་ཁ་དོག་གསེར་འདྲ་བ་བྲི་བར་བྱའོ། །
en: “The second, Tathāgata Saṃkusumita­rājendra, should be painted in golden color

source: གསུམ་པ་པདྨའི་གཙུག་ཏོར་པདྨའི་གེ་སར་དང་འདྲ་བ་ཆོས་འཆད་པ་བྲི་བར་བྱའོ། །
en: “Tathāgata Śālendra­rāja should be painted as the third. He is of the color of lotus filaments and is expounding the Dharma.

source: བཞི་པ་སྤྱན་བཟང་པོ་ཡང་བྲི་བར་བྱའོ། །
en: The fourth to be painted is Tathāgata Sunetra;

source: ལྔ་པ་བསྙེན་པར་དཀའ་བ་དང་།
en: the fifth is Duḥprasaha;

source: དྲུག་པ་རྒྱལ་བ་རྣམ་པར་སྣང་མཛད་དང་།
en: the sixth is Vairocana, the Victorious One;

source: བདུན་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དང་།
en: the seventh, Bhaiṣajya­vaidūrya­rāja;

source: བརྒྱད་པ་དེ་བཞིན་གཤེགས་པ་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་བྱེད་པའི་སྤྱན་གྱི་རྒྱལ་པོ་བྲི་བར་བྱའོ། །
en: and the eighth, Tathāgata Rājendra, the pacifier of all suffering.

source: འདི་དག་ཐམས་ཅད་ཀྱང་གསེར་གྱི་མདོག་ཅན་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གཟུགས་སུ་བྲི་བར་བྱའོ། །
en: All of them should be depicted endowed with tathāgata forms of golden color, displaying the hand gesture of granting fearlessness. {4.79}
